function conv(textFromMidi) {
    var iconv = require('iconv-lite');

    // text = 'Ýé |òî|ðå|ðî | |æèçíü |êàê |ìèã | |Î|ïÿòü |çâó|÷èò |òðó|áû | |ïðè|çûâ|íûé |çîâ | |Ýé |òî|ðå|ðî |òû |è|ëè |áûê | |êà|÷à|åò|ñÿ |÷à|øà |âå|ñîâ | | |Áîã |õðà|íèò |òå|áÿ | |ñìåðòü |ùà|äèò |òå|áÿ | | |Íå|áà |áå|ëûé |ïëà|òîê | |êðîâü |è |æåë|òûé |ïå|ñîê | |Êðèê |îò|÷à|ÿíü|ÿ | |áûê |æè|âà|ÿ |ìè|øåíü | |Ïîä |âîñ|òîð|æåí|íûé |âîé | |òû |èã|ðà|åøü |ñóäü|áîé | |Ïóñòü |íå |çíà|åò |íèê|òî | |÷òî |òâî|ðèò|ñÿ |â_äó|øå | | |Ýé |òî|ðå|ðî | |ñûí |âäî|âû | |Òâîé |êðàñ|íûé |ïëàù |òâîé | |òðà|óð|íûé |ïîê|ðîâ | |Ýé |òî|ðå|ðî |òû | |áó|äåøü |ó|áèò | |Ïîä |ïåñ|íþ | |ìàä|ðèä|ñêèõ |÷à|ñîâ | | |Áîã |õðà|íèò |òå|áÿ | |ñìåðòü |ùà|äèò |òå|áÿ | | |Íå|áà |áå|ëûé |ïëà|òîê | |êðîâü |è |æåë|òûé |ïå|ñîê | |Êðèê |îò|÷à|ÿíü|ÿ | |áûê |æè|âà|ÿ |ìè|øåíü | |Ïîä |âîñ|òîð|æåí|íûé |âîé | |òû |èã|ðà|åøü |ñóäü|áîé | |Ïóñòü |íå |çíà|åò |íè|êòî | |÷òî |òâî|ðèò|ñÿ |â_äó|øå | | |Íå|áà |áå|ëûé |ïëà|òîê | |êðîâü |è |æåë|òûé |ïå|ñîê | |Êðèê |îò|÷à|ÿíü|ÿ | |áûê |æè|âà|ÿ |ìè|øåíü | |Ïîä |âîñ|òîð|æåí|íûé |âîé | |òû |èã|ðà|åøü |ñóäü|áîé | |Ïóñòü |íå |çíà|åò |íè|êòî | |÷òî |òâî|ðèò|ñÿ |â_äó|øå | |'

    buf = iconv.encode(textFromMidi, 'latin-1');

    // Convert from an encoded buffer to a js string.
    str = iconv.decode(Buffer.from(buf), 'win1251');

    // Convert from a js string to an encoded buffer.
    // buf = iconv.encode("Sample input string", 'win1251');

    // Check if encoding is supported
    iconv.encodingExists("us-ascii")

    // console.log(buf)
    // console.log(str)
    return str

}
console.log(conv('Ýé |òî|ðå|ðî |'))
